soap-dumps/2025-06-10/1749549901602_56913b8e-e1ef-4629-8bbc-d0df1ac81ad2_request_MatrikkelenhetServiceWS.xml

<?xml version="1.0" encoding="UTF-8"?>
  <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                    xmlns:mat="http://matrikkel.statkart.no/matrikkelapi/wsapi/v1/service/matrikkelenhet"
                    xmlns:dom="http://matrikkel.statkart.no/matrikkelapi/wsapi/v1/domain/matrikkelenhet"
                    xmlns:ctx="http://matrikkel.statkart.no/matrikkelapi/wsapi/v1/domain">
    <soapenv:Header/>
    <soapenv:Body>
      <mat:findMatrikkelenheter>
        <mat:matrikkelenhetsokModel>
          <dom:kommunenummer>0301</dom:kommunenummer>
          <dom:gardsnummer>73</dom:gardsnummer>
          <dom:bruksnummer>704</dom:bruksnummer>
        </mat:matrikkelenhetsokModel>
  
          <mat:matrikkelContext>
            <ctx:locale>no_NO_B</ctx:locale>
            <ctx:brukOriginaleKoordinater>false</ctx:brukOriginaleKoordinater>
  
            <ctx:koordinatsystem>
              <ctx:kodeId>25833</ctx:kodeId>
            </ctx:koordinatsystem>
  
            <ctx:systemVersion>trunk</ctx:systemVersion>
            <ctx:klientIdentifikasjon>bis</ctx:klientIdentifikasjon>
            <ctx:snapshotVersion>9999-01-01T00:00:00+01:00</ctx:snapshotVersion>
          </mat:matrikkelContext>
      </mat:findMatrikkelenheter>
    </soapenv:Body>
  </soapenv:Envelope>